[
  {
    "file": "experiments/LongPath.js",
    "name": "Alice Path",
    "description": "Alice Path is the name of this piece of art, which draws its inspiration from Lewis Carroll's Alice's Adventures in Wonderland. The purpose of this artwork is to visually represent a whimsical and surreal pathway leading to Wonderland, capturing the essence of the fantastical and dreamlike world Alice encounters in the story.",
    "background": "The main goal of this art piece is to visualize an entrance to Wonderland that was inspired by Alice in Wonderland. The goal is to create a road that is abstract, colorful, and reminiscent of a fantastical or whimsical journey to match the idea of Alice's experiences ",
    "github": "https://github.com/ju-nmd2021/creative-coding-portfolio-tallkiarash.git"
  },

  {
    "file": "experiments/RandomShapes.js",
    "name": "Random Shapy",
    "description": "The idea behind this piece of art is to introduce randomness into the formation of forms and colours in order to create an abstract and aesthetically dynamic background.",
    "background": "The artwork adheres to the ideas of Abstract Expressionism in its use of randomness, brilliant colours, and absence of a definite representational topic. This trend has been influenced by artists with a reputation for creating emotive, non-representational works of art, such as Jackson Pollock and Mark Rothko.",
    "github": "https://github.com/ju-nmd2021/creative-coding-portfolio-tallkiarash.git"
  },

  {
    "file": "experiments/WaveSea.js",
    "name": "Sin wave",
    "description": "The concept and goal of the piece of art, Wave Sin, are to use sine waves to produce a visually arresting and rhythmic pattern.",
    "background": "This piece of art can be compared to the use of repeated patterns and optical illusions in Op Art, as demonstrated by artists like Bridget Riley. Op art frequently examines how lines, forms, and colours affect how the spectator perceives an image.",
    "github": "https://github.com/ju-nmd2021/creative-coding-portfolio-tallkiarash.git"
  },

  {
    "file": "experiments/DominoBricks.js",
    "name": "Domino Bricks",
    "description": "The idea behind Domino Bricks is to use straightforward geometric forms (rectangles) with a regulated amount of colour unpredictability to produce an aesthetically pleasing and complicated pattern. Similar to a grid of dominoes, the pattern's repetitiveness symbolizes order and predictability.",
    "background": "Domino Bricks is inspired by minimalism and abstract geometric art styles because of its repetitive use of basic geometric shapes. Similar concepts of repetition and geometry were explored by artists like Sol LeWitt and Frank Stella.",
    "github": "https://github.com/ju-nmd2021/creative-coding-portfolio-tallkiarash.git"
  },

  {
    "file": "experiments/cloudy.js",
    "name": "cloudy sky",
    "description": "The core concept behind this ethereal spectacle is to immerse you in the boundless expanse of the sky, creating the sensation of soaring beyond the clouds.",
    "background": "This art piece draws its primary inspiration from the ethereal world of Maxfield Parrish's Clouds.",
    "github": "https://github.com/ju-nmd2021/creative-coding-portfolio-tallkiarash.git"
  },

  {
    "file": "experiments/FantasyRain.js",
    "name": "Fantasy Rain",
    "description": "The primary objective of Fantasy Rain is to capture the mesmerizing beauty of rain cascading down a car window when the vehicle is serenely parked, evoking a sense of enchantment and wonder.",
    "background": "The inspiration of this art piece is from the rain on the widow of the car.",
    "github": "https://github.com/ju-nmd2021/creative-coding-portfolio-tallkiarash.git"
  },

  {
    "file": "experiments/perfiled.js",
    "name": "perfiled Circles",
    "description": "My work aims to research the aesthetic potential of code, look at how noise and randomness may produce patterns that are aesthetically pleasing, or simply produce a visually beautiful piece of generative art.",
    "background": "Rather of presenting actual things or scenes, it emphasizes on colour, form, and motion. With trends like Abstract Expressionism and Op Art, abstract art frequently aims to evoke feelings, provoke thinking, or confound vision.",
    "github": "https://github.com/ju-nmd2021/creative-coding-portfolio-tallkiarash.git"
  },

  {
    "file": "experiments/SideField.js",
    "name": "Side Field",
    "description": "This work of art has an eye-catching, dynamic design that seems like a plant growing on a wall.",
    "background": "The pattern has an unpredictable and changing quality that is evocative of chaotic systems. It relates to the idea of complexity in science and art, where straightforward rules may produce complex and unanticipated results.",
    "github": "https://github.com/ju-nmd2021/creative-coding-portfolio-tallkiarash.git"
  },

  {
    "file": "experiments/frameField.js",
    "name": "frame Field",
    "description": "A kind of digital art where the visual or auditory compositions are produced using random processes and algorithms. The distinction between the artist's aim and the impact of the machine is frequently blurred in generative art, producing a distinctive style.",
    "background": "Inspired by generative artists and projects, including those of Casey Reas, Joshua Davis, and the Processing community, a programming language and environment made specifically for artists.",
    "github": "https://github.com/ju-nmd2021/creative-coding-portfolio-tallkiarash.git"
  },

  {
    "file": "experiments/PerNoise.js",
    "name": "PerNoise",
    "description": "To hear the sound just click anywhere on the screen to hear the sound (Noise!).A kind of digital art where the visual or auditory compositions are produced using random processes and algorithms. The distinction between the artist's aim and the impact of the machine is frequently blurred in generative art, producing a distinctive style.",
    "background": "Inspired by generative artists and projects, including those of Casey Reas, Joshua Davis, and the Processing community, a programming language and environment made specifically for artists.",
    "github": "https://github.com/ju-nmd2021/creative-coding-portfolio-tallkiarash.git"
  },

  {
    "file": "experiments/pefieldGlass.js",
    "name": "pefieldGlass",
    "description": "This is just new version of the perfield",
    "background": "Worms are working there!",
    "github": "https://github.com/ju-nmd2021/creative-coding-portfolio-tallkiarash.git"
  },

  {
    "file": "experiments/perfiled2.js",
    "name": "Perfiled 2",
    "description": "This is just new version of the perfield",
    "background": "Inspired By Moana Logo",
    "github": "https://github.com/ju-nmd2021/creative-coding-portfolio-tallkiarash.git"
  },

  {
    "file": "experiments/frameField02.js",
    "name": "frameField 2",
    "description": "This is just new version",
    "background": "Waves are there Be Very Careful",
    "github": "https://github.com/ju-nmd2021/creative-coding-portfolio-tallkiarash.git"
  }
]